package ch7;

/*
 * <static: 클래스의, 공통적인>
 * 
 * static 멤버변수
 * - 모든 인스턴스에 공통적으로 사용되는 클래스 변수가 된다.
 * - 클래스 변수는 인스턴스를 생성하지 않고도 사용 가능하다.
 * - 클래스가 메모리에 로드될 때 생성된다. 
 * 
 * static 메서드
 * - 인스턴스를 생성하지 않고도 호출이 가능한 static 메서드가 된다.
 * - static 메서드 내에서는 인스턴스 멤버들을 직접 사용할 수 없다.
 * 
 * 
 * 
 * <final: 마지막의, 변경될 수 없는>
 * 
 * final 클래스
 * - 변경될 수 없는 클래스, 확장될 수 없는 클래스
 * - 그래서 다른 클래스의 조상이 될 수 없다. 무조건 마지막 자손
 * 
 * final 메서드
 * - 변경될 수 없는 메서드
 * - 오버라이딩을 통해 재정의 될 수 없다.
 * 
 * final 멤버변수/지역변수
 * - 값을 변경할 수 없는 상수
 * 
 * 
 * 
 * <abstract - 추상의, 미완성의>
 * 
 * abstract 클래스
 * - 클래스 내에 추상 메서드가 선언되어 있음을 의미
 * 
 * abstract 메서드
 * - 선언부만 작성하고 구현부는 작성하지 않는 추상 메서드임을 알린다.
 * 
 * -> 추상 클래스를 상속받아서 완전한 클래스를 만든 후에 객체 생성 가능하다.
 */
public class ch7_17_제어자 {

}
